import 'package:flutter/material.dart';
import 'package:notesewa/Reading%20Section/heading.dart';
import 'package:notesewa/Reading%20Section/paragraph.dart';

class NepalkoBhaugolikAwastha extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: ListView(
          children: [
            Divider(
              thickness: 2,
              height: 15,
              indent: 20,
              endIndent: 20,
            ),
            Heading("नेपालको भौगोलिक अवस्था"),
            Divider(
              thickness: 2,
              height: 15,
              indent: 20,
              endIndent: 20,
            ),
            Paragraph("नेपाल पृथ्वीको उत्तरी गोलार्द्धको एसिया महादेशमा पर्दछ । नेपालको सिमाना जोडिएका छिमेकी मुलुक भारत र चीन हुन् ।"),
            Paragraph("नेपालको पूर्व, पश्चिम र दक्षिणी सिमाना भारतको ५ वटा प्रान्तहरू (उत्तराखण्ड, उत्तर प्रदेश, बिहार, सिक्किम र पश्चिम बंगाल) सँग जोडिएको छ भने उत्तरतर्फ चीनको स्वशासित प्रदेश तिब्बतसँग जोडिएको छ ।"),
            Paragraph("नेपाल भारतभन्दा २२ गुना र चीनभन्दा ६५ गुना सानो छ । नेपाल हिमाल, पहाड र तराईको सम्मिश्रित भूवनोट भएको देश भएकोले जलवायुमा विविधता भएको कारणले यहाँ विश्वमा पाइने सबै प्रमुख जलवायु पाइन्छ।"),
            Paragraph("नेपालको तराई र भाँवर क्षेत्रमा उष्ण हावापानी, मध्य पहाडी क्षेत्रमा समशीतोष्ण हावापानी र हिमाली क्षेत्रमा शीत हावापानी पाइन्छ। नेपाल जैविक विविधताको दृष्टिले विश्वमा २५औं स्थानमा र एसियामा ११औं स्थानमा पर्दछ ।"),
            Paragraph("फूल फुल्ने वोट विरुवाहरूको विविधतामा एसियामा दशौं स्थानमा र विश्वमा २७ औं स्थानमा पर्दछ । नेपालमा ६३५ प्रजातिका पुतली, 3295५ प्रजातिका माछा, ४३ प्रजातिका उभयचर, १०० प्रजातिका सरिसृप (Reptiles), ८८७ भन्दा बढी प्रजातिका चराहरू, १८१ प्रजातिका स्तनधारी प्राणी पाइन्छन्।"),
            Paragraph("वनस्पतितर्फ ६५०० प्रजातिका एजियोस्पर्म, २८ प्रजातिका जिम्नोस्पर्म, भण्डै ५ू००० प्रजातिका फूल नफुल्नें वनस्पतिहरू पाइन्छन् । यी वनस्पतिहरूमध्ये ७०० भन्दा बढी औषधीय गुण भएका, ४०० भन्दा बढी खान हुने, ३०० प्रकारका वनस्पति रैथाने र १०० भन्दा बढी वनस्पतिहरू अति दुर्लभ र लोपोन्मुख अवस्थामा रहेका छन्।"),
            Paragraph("नेपालमा पाइने चराहरूमध्ये १५९ प्रजातिका चराहरू लापोन्मुख सूचिमा पर्दछन् । नेपालमा चराहरू र वासस्थानको संरक्षण र चराचुरुङ्गीहरूको अध्ययन गर्ने उद्देश्यले सन् १९८२ मा नेपाल पंक्षी संरक्षण संघ (Bird Conservation Nepal - BCN) स्थापना भएको छ।"),
            Paragraph("यो संस्थाले समय समयमा Welcome to the birds = WTTB कार्यक्रमहरू सञ्चालन गर्दै आएको छ । यसले अत्यन्तै संकटापन्न भई लोपोन्मुख अवस्थामा रहेको Bengal Florican प्रजातिको चरा संरक्षणका लागि एक छुट्टै परियोजना समेत सञ्चालन गरेको छ।"),
            Paragraph("भीमसेन थापाको पालामा नेपालमा रेजिडेन्टका रुपमा रहेका ब्रायन एच हडसनले नेपालको विषयमा लेखिएको पुस्तकमा नेपालमा पाइने चराहरूको बारेमा सचित्र वर्णन गरिएको छ। सन् १८२०-२१ तीर आज भन्दा २०० वर्ष अगाडि लेखिएको यो पुस्तक नेपालका चराहरूका बारेमा लेखिएको पहिलो पुस्तक मानिन्छ। यो पुस्तकमा वर्णन गरिएका चराहरूको चित्र बनाउने काम तत्कालीन राजमान सिंह चित्रकारले गरेका थिए।"),
            Paragraph("सन् २०१७ को अक्टोबर सम्ममा नेपालमा ८८७ प्रजातिका चराचुरुङ्गीहरू पाइएका छन् । नेपालमा सबैभन्दा पछि पत्तालागेका चरा रुफस टेल्ड एकथ्रस, ग्रे साइडेड थ्रस, वेस्ट हिमालय बुस बाब्लर र Ruddy Turnstone हुन ।"),
            Divider(
              thickness: 2,
              height: 15,
              indent: 20,
              endIndent: 20,
            ),
          ],
        ),
      ),
    );
  }
}
